Revit 2024 API
SpatialFieldManager.GetLegend Method
 Returns legend element or NULL
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public AnalysisDisplayLegend GetLegend()
Visual Basic
Public Function GetLegend As AnalysisDisplayLegend
Visual C++
public:
AnalysisDisplayLegend^ GetLegend()
Return Value
 The legend element or NULL
See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace